<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 7 changes.</summary>

```diff
! tailscale_tailnet_key.tailscale_key must be replaced
! module.debian13.proxmox_virtual_environment_vm.vm_template will be updated in-place
+ module.debian13.terraform_data.combined_ci_hash will be created
! module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be updated in-place
! module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be updated in-place
+ module.vm_minimal_config.terraform_data.combined_ci_hash will be created
+ module.vm_minimal_config.module.cloud_init_files.proxmox_virtual_environment_file.ci_user_data[0] will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 4 to add, 3 to change, 1 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-11T02:06:22Z [(view log)](https://github.com/perchnet/p/actions/runs/16869256480/job/47780879577#step:11:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # tailscale_tailnet_key.tailscale_key must be replaced
-/+ resource "tailscale_tailnet_key" "tailscale_key" {
      ~ created_at    = "2025-08-10T22:27:31Z" -> (known after apply)
      ~ expires_at    = "2025-08-10T22:37:31Z" -> (known after apply)
      ~ id            = "k56pDn7mHT11CNTRL" -> (known after apply)
      ~ invalid       = true -> (known after apply)
      ~ key           = (sensitive value)
      ~ reusable      = false -> true # forces replacement
        tags          = [
            "tag:web-ingress",
        ]
      + user_id       = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.debian13.proxmox_virtual_environment_vm.vm_template will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm_template" {
      ~ description             = "Terraform generated template on 2025-08-11T01:07:09Z" -> (known after apply)
        id                      = "9013"
        name                    = "debian13"
        tags                    = [
            "debian",
            "template",
            "terraform",
        ]
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.debian13.terraform_data.combined_ci_hash will be created
  + resource "terraform_data" "combined_ci_hash" {
      + id     = (known after apply)
      + input  = {
          + hash = 0
        }
      + output = (known after apply)
    }

  # module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm_template" {
      ~ description             = "Terraform generated template on 2025-08-11T01:07:09Z" -> (known after apply)
        id                      = "8022"
        name                    = "ubuntu22"
        tags                    = [
            "template",
            "terraform",
            "ubuntu",
        ]
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "10000"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "vm-ubuntu22-minimal"
      ~ network_interface_names = [] -> (known after apply)
      ~ scsi_hardware           = "virtio-scsi-pci" -> "virtio-scsi-single"
      ~ started                 = false -> true
        # (23 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # module.vm_minimal_config.terraform_data.combined_ci_hash will be created
  + resource "terraform_data" "combined_ci_hash" {
      + id     = (known after apply)
      + input  = {
          + hash = 0
        }
      + output = (known after apply)
    }

  # module.vm_minimal_config.module.cloud_init_files.proxmox_virtual_environment_file.ci_user_data[0] will be created
  + resource "proxmox_virtual_environment_file" "ci_user_data" {
      + content_type           = "snippets"
      + datastore_id           = "snippets"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "pve1"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = (known after apply)
          + file_name = (known after apply)
          + resize    = 0
        }
    }

Plan: 4 to add, 3 to change, 1 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-43-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->